R1:
R1>enable 
R1#configure terminal
R1(config)#interface g0/0
R1(config-if)#ip helper-address 10.1.1.2

R2:
R2>enable
R2#configure terminal
R2(config)#ip dhcp excluded-address 192.168.10.1 192.168.10.10
R2(config)#ip dhcp excluded-address 192.168.30.1 192.168.30.1
R2(config)#ip dhcp pool R1-LAN
R2(dhcp-config)#network 192.168.10.0 255.255.255.0
R2(dhcp-config)#default-router 192.168.10.1
R2(dhcp-config)#dns-server 192.168.20.254
R2(dhcp-config)#exit
R2(config)#ip dhcp pool R3-LAN
R2(dhcp-config)#network 192.168.30.0 255.255.255.0
R2(dhcp-config)#default-router 192.168.30.1
R2(dhcp-config)#dns-server 192.168.20.254
R2 (dhcp-config)#exit
R2#configure terminal
R2(config)#interface g0/1
R2(config-if)#ip address dhcp
R2(config-if)#no shutdown
R2#show ip interface brief

R3:
R3>enable
R3#configure terminal
R3(config)#interface g0/0
R3(config-if)#ip helper-address 10.2.2.2

PC1:
C:\>ping 192.168.30.11
C:\>ping 209.165.202.158
C:\>ping 209.165.202.157

PC2:
C:\>ping 192.168.10.11
C:\>ping 209.165.202.158
C:\>ping 209.165.202.157